[
{
"question":" What is the purpose of the Victim Empowerment Programme (VEP)?",
"response": " The project aims to support victims, survivors and the respective family members of persons who have experienced crime (e.g. you were robbed/ a loved one was murdered) and violence (e.g. victim of emotional, physical or sexual abuse). The VEP's support services also extends to Gender-Based-Violence (GBV), whereby the therapeutic services aids to deal with the impact of the incident that had been experienced."
},
{
"question":"What is gender-based violence (GBV)? ",
"response": " Is VIOLENCE that is directed at an individual BASED on their biological sex OR gender identity. It includes physical, verbal, emotional and psychological abuse, threats, economic or educational deprivation whether occurring in public or private life."
},
{

"question":"What is trauma? ",
"response": "Trauma is the debilitating symptoms that many people suffer from, on the aftermath of perceived life-threatening or overwhelming situations. Trauma is about the loss of connection to us, our bodies, to our families, to others and to the world around us. "
},{
"question":"Who will respond to my inquiry on the Touching Nations App? ",
"response": "  Qualified and registered social worker’s and social auxiliary worker’s who are employed at Touching Nations will and are responsible for responding to quires made on the App.\n\n. By when can I expect a response from my inquiry on the Touching Nations App? Within 2-days (48 hours) if it is Monday-Friday (08:00-15:30), excluding weekends and public holidays."
},
{
"question":"Are Touching Nations VEP services free?",
"response": "Touching Nations VEP services are free and open to members of the public that are 18 years and older and reside within Elsies River, Delft and its surrounding areas. "
},
{
"question":" What services does Touching Nations VEP offer? ",
"response": "The focus of the services is two-fold: firstly, to render psychosocial support services that encompasses therapeutic counseling on an individual, couple, family, and group. Secondly, educational workshops that comprise of awareness and preventive measures around crime and violence.The objectives of the project are to ensure that victims receive emotional and practical support, to assist victims with the management of trauma and lastly to refer victims to appropriate services where need be."
},
{
"question":" How else can I access Touching Nations VEP services?",
"response": "You can call Touching Nations VEP office: 021 224 0983 "
}

]